#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
Адрес = Параметры.Адрес;

ДанныеОтпуска = ПолучитьИзВременногоХранилища(Адрес);

Планированиеотпусков.Очистить();
//Планированиеотпусков.Отображатьлегенду = Ложь;

//вот это почему-то не работает
Планированиеотпусков.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Месяц;
ПланированиеОтпусков.КратностьПериодическогоВарианта = 1;
//-

Для Каждого Строка Из ДанныеОтпуска Цикл
	Точка = Планированиеотпусков.УстановитьТочку(Строка.Сотрудник);
	
	Точка.Текст = Строка.Сотрудник;
	
	Серия = Планированиеотпусков.УстановитьСерию("Отпуск");
	Серия.Текст = "Отпуск";
	
	Значение = Планированиеотпусков.ПолучитьЗначение(Точка,Серия);
	Интервал = Значение.Добавить();
	Интервал.Начало = Строка.ДатаНачала;
	Интервал.Конец = Строка.ДатаОкончания;
	
КонецЦикла;

КонецПроцедуры

#КонецОбласти